#include <iostream>         /* Основная, содержит cin,cout и др. */
#include <stdio.h>              /*стандартная библиотека С и позволяющая работать с функциями такими как printf,scanf,gets,getchar,putchar и др.*/
#include <cmath>                    /* содержит функции для выполнения математических задач(например cos(),log и др.) */
#include <ctime>                /*содержит функции для работы со временем и датой (например time,clock и др.)*/
#include <conio.h>          /* содержит несколько консольных функция для работы с  вводом и выводом типо функции getch()*/
#include <iomanip>     /* Содержит основные манипуляторы(например endl,setw и др.) */
#include <string>